In [4]:
#泰坦尼克乘客数据查验
import pandas as pd 
titanic=pd.read_csv("http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic.txt")
titanic.head()

   row.names pclass  survived                                             name  ...  room      ticket   boat     sex
0          1    1st         1                     Allen, Miss Elisabeth Walton  ...   B-5  24160 L221      2  female
1          2    1st         0                      Allison, Miss Helen Loraine  ...   C26         NaN    NaN  female
2          3    1st         0              Allison, Mr Hudson Joshua Creighton  ...   C26         NaN  (135)    male
3          4    1st         0  Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)  ...   C26         NaN    NaN  female
4          5    1st         1                    Allison, Master Hudson Trevor  ...   C22         NaN     11    male

[5 rows x 11 columns]

In [5]:
titanic.info()   #共有1313条数据，有些特征数据缺失

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 11 columns):
row.names    1313 non-null int64
pclass       1313 non-null object
survived     1313 non-null int64
name         1313 non-null object
age          633 non-null float64
embarked     821 non-null object
home.dest    754 non-null object
room         77 non-null object
ticket       69 non-null object
boat         347 non-null object
sex          1313 non-null object
dtypes: float64(1), int64(2), object(8)
memory usage: 112.9+ KB

In [6]:
#数据预处理
X=titanic[['pclass','age','sex']]   #先选择这三个特征
y=titanic['survived']
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 3 columns):
pclass    1313 non-null object
age       633 non-null float64
sex       1313 non-null object
dtypes: float64(1), object(2)
memory usage: 30.9+ KB

In [7]:
#对age列数据进行补全：使用平均数或者中位数都是对模型偏离造成最小影响的策略
X['age'].fillna(X['age'].mean(),inplace=True)
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 3 columns):
pclass    1313 non-null object
age       1313 non-null float64
sex       1313 non-null object
dtypes: float64(1), object(2)
memory usage: 30.9+ KB

C:\Users\SONG\Anaconda3\lib\site-packages\pandas\core\generic.py:6130: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._update_inplace(new_data)

In [9]:
#数据分割
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.25,random_state=33)
#将类别型特征转为ont-hot
from sklearn.feature_extraction import DictVectorizer
vec=DictVectorizer()
X_train=vec.fit_transform(X_train.to_dict(orient='record'))
print(vec.feature_names_)
X_test=vec.transform(X_test.to_dict(orient='record'))

['age', 'pclass=1st', 'pclass=2nd', 'pclass=3rd', 'sex=female', 'sex=male']

In [10]:
#训练模型
from sklearn.tree import DecisionTreeClassifier
dtc=DecisionTreeClassifier()
dtc.fit(X_train,y_train)
y_predict=dtc.predict(X_test)

In [11]:
from sklearn.metrics import classification_report
print("the accuracy is :",dtc.score(X_test,y_test))
print("the detailed is :",classification_report(y_test,y_predict,target_names=['died','survived']))

the accuracy is : 0.7811550151975684
the detailed is :               precision    recall  f1-score   support

        died       0.78      0.91      0.84       202
    survived       0.80      0.58      0.67       127

   micro avg       0.78      0.78      0.78       329
   macro avg       0.79      0.74      0.75       329
weighted avg       0.78      0.78      0.77       329